-- Automatic generation from -->>
-- excel file  name: A_array表示例--cfg_array
-- excel sheet name: 示例1-example1

local cfg_array_example1 =
--:  id                  	## 唯一id
--:  str                 	## 佩戴位置
--:  level               	## 等级
--:  sub_level           	## 等级
--:  name                	## 装备名字
--:  attr                	## 装备增加属性
--:  desc1               	## 装备来源描述

{
  [1001] = 
    {
      pos1 = 
        {
          [88] = 
            {
              [1] = 
                {
                  id = 1001,
                  str = 'pos1',
                  level = 88,
                  sub_level = 1,
                  name = '黑切+蓝盾',
                  desc1 = '从小城镇',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                },
              [2] = 
                {
                  id = 1001,
                  str = 'pos1',
                  level = 88,
                  sub_level = 2,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                }
            },
          [89] = 
            {
              [89] = 
                {
                  id = 1001,
                  str = 'pos1',
                  level = 89,
                  sub_level = 89,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                }
            }
        },
      pos2 = 
        {
          [88] = 
            {
              [88.9] = 
                {
                  id = 1001,
                  str = 'pos2',
                  level = 88,
                  sub_level = 88.9,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                }
            },
          [89] = 
            {
              [89] = 
                {
                  id = 1001,
                  str = 'pos2',
                  level = 89,
                  sub_level = 89,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                }
            }
        }
    },
  [1002] = 
    {
      pos1 = 
        {
          [88] = 
            {
              [88] = 
                {
                  id = 1002,
                  str = 'pos1',
                  level = 88,
                  sub_level = 88,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 901
                        }
                    }
                }
            },
          [89] = 
            {
              [89] = 
                {
                  id = 1002,
                  str = 'pos1',
                  level = 89,
                  sub_level = 89,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                }
            },
          [90] = 
            {
              [90] = 
                {
                  id = 1002,
                  str = 'pos1',
                  level = 90,
                  sub_level = 90,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 901
                        }
                    }
                }
            }
        },
      pos2 = 
        {
          [88] = 
            {
              [88] = 
                {
                  id = 1002,
                  str = 'pos2',
                  level = 88,
                  sub_level = 88,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 901
                        }
                    }
                }
            },
          [89] = 
            {
              [89] = 
                {
                  id = 1002,
                  str = 'pos2',
                  level = 89,
                  sub_level = 89,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 900
                        }
                    }
                }
            },
          [90] = 
            {
              [90] = 
                {
                  id = 1002,
                  str = 'pos2',
                  level = 90,
                  sub_level = 90,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 901
                        }
                    }
                }
            }
        }
    },
  [1003] = 
    {
      pos1 = 
        {
          [85] = 
            {
              [85] = 
                {
                  id = 1003,
                  str = 'pos1',
                  level = 85,
                  sub_level = 85,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 902
                        }
                    }
                }
            }
        }
    },
  [1004] = 
    {
      pos1 = 
        {
          [80] = 
            {
              [80] = 
                {
                  id = 1004,
                  str = 'pos1',
                  level = 80,
                  sub_level = 80,
                  name = '黑切+蓝盾',
                  desc1 = '有钱就可以买',
                  attr = 
                    {
                      [1] = 
                        {
                          [1] = 1,
                          [2] = 700
                        },
                      [2] = 
                        {
                          [1] = 2,
                          [2] = 800
                        },
                      [3] = 
                        {
                          [1] = 3,
                          [2] = 903
                        }
                    }
                }
            }
        }
    }
}
return cfg_array_example1