-- Automatic generation from -->>
-- excel file  name: A_array表示例--cfg_array
-- excel sheet name: 示例2+example2

local cfg_array_example2 =
--:  id                  	## 英雄id
--:  name                	## 英雄名字
--:  material            	## 合成消耗
--:  attr                	## 属性
--:  award1              	## 奖励1
--:  award2              	## 奖励2

{
  [1] = 
    {
      id = 1,
      name = 'examp1001',
      material = 
        {
          [1] = 
            {
              res = 1,
              id = 10001,
              count = 1
            },
          [2] = 
            {
              res = 1,
              id = 10001,
              count = 1
            }
        },
      attr = 
        {
          [1] = 
            {
              [1] = 1,
              [2] = 700
            },
          [2] = 
            {
              [1] = 2,
              [2] = 800
            },
          [3] = 
            {
              [1] = 3,
              [2] = 900
            },
          [4] = 
            {
              add = 
                {
                  [1] = 4,
                  [2] = 100
                }
            }
        },
      award1 = 
        {
          [1] = 1,
          [2] = 2,
          [3] = 3
        },
      award2 = 
        {
          id = 1,
          type = 2,
          num = 3
        }
    },
  [2] = 
    {
      id = 2,
      name = 'examp1002',
      material = 
        {
          res = 1,
          id = 10001,
          count = 1
        },
      attr = 
        {
          [1] = 
            {
              [1] = 1,
              [2] = 700
            },
          [2] = 
            {
              [1] = 2,
              [2] = 800
            },
          [3] = 
            {
              [1] = 3,
              [2] = 901
            },
          [4] = 
            {
              add = 
                {
                  [1] = 5,
                  [2] = 100
                }
            }
        },
      award1 = 
        {
          [1] = 1,
          [2] = 2,
          [3] = 3
        },
      award2 = 
        {
          id = 1,
          type = 2,
          num = 3
        }
    },
  [3] = 
    {
      id = 3,
      name = 'examp1003',
      material = 
        {
          [1] = 1,
          [2] = 2,
          [3] = 3,
          [4] = 4,
          [5] = 5,
          [6] = 6,
          [7] = 7,
          [8] = 8,
          [9] = 9,
          [10] = 9,
          [11] = 9,
          [12] = 9,
          [13] = 9,
          [14] = 9,
          [15] = 9,
          [16] = 9,
          [17] = 9,
          [18] = 9
        },
      attr = 
        {
          [1] = 
            {
              [1] = 1,
              [2] = 700
            },
          [2] = 
            {
              [1] = 2,
              [2] = 800
            },
          [3] = 
            {
              [1] = 3,
              [2] = 902
            },
          [4] = 
            {
              add = 
                {
                  [1] = 6,
                  [2] = 100
                }
            }
        },
      award1 = 
        {
          [1] = 1,
          [2] = 2,
          [3] = 3
        },
      award2 = 
        {
          id = 1,
          type = 2,
          num = 3
        }
    },
  [4] = 
    {
      id = 4,
      name = 'examp1004',
      material = 
        {
          [1] = '测试数据',
          [2] = '测试数据2',
          [3] = '测试数据3'
        },
      attr = 
        {
          [1] = 
            {
              [1] = 1,
              [2] = 700
            },
          [2] = 
            {
              [1] = 2,
              [2] = 800
            },
          [3] = 
            {
              [1] = 3,
              [2] = 903
            },
          [4] = 
            {
              add = 
                {
                  [1] = 7,
                  [2] = 100
                }
            }
        },
      award1 = 
        {
          [1] = 1,
          [2] = 2,
          [3] = 3
        },
      award2 = 
        {
          id = 1,
          type = 2,
          num = 3
        }
    },
  [5] = 
    {
      id = 5,
      name = 'examp1004',
      material = 
        {
          [1] = 'test'
        },
      attr = 
        {
          [1] = 
            {
              [1] = 1,
              [2] = 700
            },
          [2] = 
            {
              [1] = 2,
              [2] = 800
            },
          [3] = 
            {
              [1] = 3,
              [2] = 903
            },
          [4] = 
            {
              add = 
                {
                  [1] = 7,
                  [2] = 100
                }
            }
        },
      award1 = 
        {
          [1] = 1,
          [2] = 2,
          [3] = 3
        },
      award2 = 
        {
          id = 1,
          type = 2,
          num = 3
        }
    }
}
return cfg_array_example2